{
  "objects": [
    {
      "slug": "diamond-strategy-for-open-talent",
      "title": "Diamond Strategy for Open Talent",
      "content": "",
      "metadata": {
        "title": "The Four Sided Strategy for Open Talent",
        "subtitle": "Balancing all four points creates an effective approach.",
        "content": "<p><br></p><p>When I&#39;m working with organisations who are building open talent communities, it&#39;s a pretty common journey we take.&nbsp;</p><p>We always start with <strong>Ambition</strong>, intention or purpose - why do you want to build a bench of people? what do you want to be able to do with this group? Getting to the heart of the question helps to shape the initial direction, but also thinking down the line to what it could deliver over time is important.</p><p>Next <strong>Alumni and Attraction</strong> - understanding who you already have, where the gaps are, establishing inbound channels for building up an initial group of people to work alongside, as well as ensuring they&#39;re onboarded well.</p><p>Then <strong>Nurture</strong> - making sure the people in your group are well supported, have what they need to do great work with you, and the community continues to grow over time. This is as much about process and operations as it is engagement and support.</p><p>And <strong>Activation</strong> - what are the ways of bringing this group to life, how to make the very most of them, how to go beyond just throwing a brief into the mix, but also creating teams and sourcing insights from the crowd.</p><p><br></p><p>Whilst each part can be looked at individually, it&#39;s the most effective when considered holistically - as each piece interplays with the other.</p><p>A strategy without intention falls apart pretty quickly. An approach without identifying who you already have, the gaps, and plans for attracting new talent - creates inefficiencies. Forgetting the nurture aspect means the pool of people dwindle over time in quality and engagement. And without considering the full range of how to activate the community means you&#39;re missing out on value you&#39;ve built, and find the diamonds in your network</p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/6f1cc620-6fd4-11ed-bac9-7fe1734a16aa-chuttersnap-sLUOsr4BoQA-unsplash.jpg",
          "imgix_url": "https://imgix.cosmicjs.com/6f1cc620-6fd4-11ed-bac9-7fe1734a16aa-chuttersnap-sLUOsr4BoQA-unsplash.jpg"
        },
        "is_featured": false,
        "articletype": {
          "key": "blog",
          "value": "blog"
        },
        "templateoverride": "",
        "downloadbox": {
          "description": "",
          "downloadkey": ""
        },
        "show_contactwidget": false,
        "date_published": "2022-11-13",
        "ordinal": ""
      }
    },
    {
      "slug": "freelance-friendly-mash",
      "title": "Freelance Friendly: Mash",
      "content": "",
      "metadata": {
        "title": "Mash is Freelance Friendly",
        "subtitle": "Learning from a freelance first business",
        "content": "<p style=\"margin-bottom: 50px;\"><iframe style=\"border-radius:12px\" src=\"https://open.spotify.com/embed/episode/3zWcTYwFdcOpXJzJrPDCb8?utm_source=generator\" width=\"100%\" height=\"152\" frameborder=\"0\" allowfullscreen=\"\" allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" data-dashlane-frameid=\"5977\"></iframe></p><p>For this episode of <strong>Freelance Friendly,</strong> I spoke to <strong>Tash Menon of Mash</strong>, a freelance-first agency who curate teams of independents to deliver big brand ideas, all without the overhead of staff.</p><p>Mash is one of those new-breed businesses which has a small core team, and has built its offering based upon a wide pool of trusted freelancers who they curate and attach to specific briefs for their clients - whilst investing in a significant way to\nbuilding support and community for those people.</p><p>&quot;A model that doesn&#39;t whitelabel freelancers, allows brands to have a team curated specifically for them, and access global big brand thinking at their fingertips - it seemed like common sense!&quot;</p><p>Built upon the insight that increasing numbers of brilliantly talented individuals are stepping out of traditional working models, or hybrid working alongside their day-jobs, exploring additional projects to complement their passions and interests, and\nbeing able to tap into that independent workforce provides a powerful offering for clients.</p><p>&quot;If we don&#39;t have exceptional freelancers coming to us, we don&#39;t have a business full stop&quot;</p><p>Tash and I spoke about why being freelance first benefits both the freelancers and the clients, what it takes to create a supportive community, and the challenges of being a company founder.</p><p>You can listen to the full episode above, or learn more about Mash at <a href=\"https://thisismash.com/\"></a><a href=\"https://thisismash.com/\">https://thisismash.com/</a></p><p><br></p><h1>Six things we learned from Mash</h1><p>1/ You can create a full service offering, with a small core team but accessing a wider pool of independent talent, leveraging freelancers and consultants to build your offering - with a &quot;no walls&quot; mindset.</p><p><br></p><p>2/ Agency employee churn can be 50% or higher, an engaged freelancer community like Mash has 3% churn - putting paid to the myth that freelancers don&#39;t stick around.</p><p><br></p><p>3/ Building an engaged freelancer community is more than just keeping a little black book of names and email addresses. Mash&#39;s two-sided thinking of &quot;transactions&quot; and &quot;engagement&quot;, is a really smart way of ensuring both process\nand connection is delivered well.</p><p><br></p><p>4/ Working independently can come with gaps, working alone, lack of collaboration, lack of training and support - being part of a collective or community can add some of that connection back, and collectives who offer this are adding value to the freelancer\nexperience. Being part of a collective can also help freelancers focus on their craft skills, rather than the rest of the offering, i.e. accounting, marketing, sales, etc.</p><p><br></p><p>5/ Don&#39;t whitelabel your freelancers - embrace the fluid talent you&#39;re building your teams from, it&#39;s one of the reasons freelancers will return to work with you again and again.</p><p><br></p><p>6/ Working with freelancers enables you to create a global workforce, tapping into local cultural insight and understanding.&nbsp;</p><p><br></p><p>Listen to more conversations with Freelance Friendly businesses on Spotify, or have a chat with us to find out how you can be Freelance Friendly, and work well with independents.</p><p><br></p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/12b4a1c0-6fcd-11ed-bac9-7fe1734a16aa-mash.png",
          "imgix_url": "https://imgix.cosmicjs.com/12b4a1c0-6fcd-11ed-bac9-7fe1734a16aa-mash.png"
        },
        "is_featured": false,
        "articletype": {
          "key": "blog",
          "value": "blog"
        },
        "templateoverride": "",
        "downloadbox": {
          "description": "",
          "downloadkey": ""
        },
        "show_contactwidget": true,
        "date_published": "2022-11-29",
        "ordinal": ""
      }
    },
    {
      "slug": "setting-an-intention",
      "title": "Setting an intention",
      "content": "",
      "metadata": {
        "title": "Setting an intention",
        "subtitle": "The strategic goal for your open talent network",
        "content": "<p>Recent <a href=\"https://www.upwork.com/research/future-workforce-report-2022\">data from upwork</a> suggests that companies who hire freelancers feel more confident during uncertainty - which suggests that freelancers are the untapped superpower as we head in to recession.</p><p>Hiring freezes, &nbsp;roles being made redundant, stalling company growth - they&#39;re all reasons to be commercially cautious around talent - yet the work still needs to be delivered - freelancers offer an amazing opportunity to access brilliant talent, on-demand, at a fraction of the cost of an employee, but with amazing results.</p><p><br></p><p><strong>But how do you even start? Do you just post on LinkedIn and hope for the best?</strong></p><p><br></p><p>The organisations I&#39;ve worked with that have the most success with freelancers have a clear intent on how they work with freelancers - not just filling the gaps, but the strategic application of fluid talent to their organisation&#39;s goals.</p><p>This is a super powerful way of starting to design your approach to open talent &nbsp;- setting an intention or ambition. The intention allows you to focus your efforts: what type of people do we need to build relationships with? when is it right to bring someone external in? why would they want to work with us? how do we engage our freelancers? how do we explain why we&#39;re using freelancers?</p><p>An intention can be as simple as &quot;scale our current capabilities&quot; or as bold as &quot;build a first class network of the right people for the right brief&quot; - but having an intention allows you to design the right model for attraction, engagement and nurture.&nbsp;</p><p><br></p><p><strong>We generally see four types of intention:</strong></p><p><strong>Scale</strong> - more of what you&#39;ve already got, or what you frequently do. <em>Requires a focus on trusted talent, and effective process.</em></p><p><strong>Strengthen</strong> - supercharging your team with senior or deep expertise.<em> Requires clear communication internally, and clear roles and ways of working.</em></p><p><strong>Stretch</strong> - into new capabilities to grow your own offering. &nbsp;<em>Requires prioritisation of efforts, and a longer-term plan.</em></p><p><strong>Solve</strong> - build a bespoke team for specific requirements. <em>Requires a clear proposition and community engagement.</em></p><p><br></p><p><strong>What&#39;s your intention?&nbsp;</strong></p><p>We host intention setting sessions, where we map out the next 12 months of your strategic goals, and how building a freelance network can support that. Drop us a note to get started well.</p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/2c0d91b0-6a53-11ed-b20b-e9b674dc18cb-pexels-canva-studio-3194518.jpg",
          "imgix_url": "https://imgix.cosmicjs.com/2c0d91b0-6a53-11ed-b20b-e9b674dc18cb-pexels-canva-studio-3194518.jpg"
        },
        "is_featured": false,
        "articletype": {
          "key": "guide",
          "value": "guide"
        },
        "templateoverride": "",
        "downloadbox": {
          "description": "",
          "downloadkey": ""
        },
        "show_contactwidget": true,
        "date_published": "",
        "ordinal": 100
      }
    },
    {
      "slug": "the-importance-of-following-up",
      "title": "The importance of following up",
      "content": "",
      "metadata": {
        "title": "The importance of following up",
        "subtitle": "Inform your network of their impact",
        "content": "<p>Most of us can be guilty of moving from one project to the next without a moment to reflect upon the outcomes. Many agency projects don&#39;t have a formal debrief or evaluation process - but where they do, and the results are clear - even fewer will include sharing those results with the entire team.</p><p>Many projects will have involved a wide network of individuals who had shared responsibility for its success - the core team, external suppliers, independents and freelancers, the client, various partners and stakeholders. And when the project delivers outstanding results, it&#39;s important to let everyone know what their work led to.</p><p>Meaningful work with impact is a critical part of mental health - and knowing what impact their work had is something that many freelancers are missing out on.</p><p>One of our key pillars of building strong relationships with the independent workforce is &quot;Feedback and Followup&quot;, both direct feedback on the project itself, during and post-project, as well as followup on the impact the work had.</p><p>One of my own favourite examples of this was a project I&#39;d worked on some years back, concepting a new brand for a food business. About 60 ice lollies turned up, the actual product we&#39;d been working on, with a note to say thank-you, and demonstration of my work moving from idea to reality. My children now are big fans of the product, and demand we buy it whenever we see it.</p><p>But even a simple email with some of the results, any awards it picked up, or even positive comments from the audience or client, can help your independents and partners recognise the impact of their work.&nbsp;</p><p>Communicating these results per project to the specific individuals who worked on each project can be a complex task - keeping track of every single person who touched a piece of work is probably more than most organisations want to do - but establishing an alumni community, and sharing regularly the outcome of projects you worked on together is a simple way of keeping your network informed, and sharing in the celebration of your success.</p><p><br></p><h3><strong>Tips for Followup Comms</strong></h3><p><strong>1/ Once the project has shipped</strong> - drop a reminder in your calendar to do a six month followup. This can kickstart an internal process to follow up with your own client, review the evaluation data, write up an internal case study, and communicate it internally.</p><p><strong>2/ Create an externally facing piece of comms around the project</strong>, and add it to the newsletter or intranet you share with your network of freelancers.&nbsp;</p><p><strong>3/ Share the followup with your network</strong>, and encourage people share the positive news via their own networks, or get in touch to celebrate the results and outcomes.</p><p><strong>4/ Tag the freelancers who worked on your most successful projects</strong> - so you start to build your list of superstars who deliver the most impactful work.</p><p><br></p><p><br></p><p>Some of the ways we help businesses work better with freelancers is by establishing Alumni Networks, and designing and implementing Community Comms - lifting the load from your todo-list, whilst making sure your network of freelancers are kept close, engaged and supported.</p><p>If you&#39;re building a your own bench of freelancer talent, we can help.&nbsp;</p><p>Drop us a note to get started.</p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/5f0da210-64c4-11ed-b20b-e9b674dc18cb-icecream.png",
          "imgix_url": "https://imgix.cosmicjs.com/5f0da210-64c4-11ed-b20b-e9b674dc18cb-icecream.png"
        },
        "is_featured": false,
        "articletype": {
          "key": "guide",
          "value": "guide"
        },
        "templateoverride": "",
        "downloadbox": {
          "description": "",
          "downloadkey": ""
        },
        "show_contactwidget": true,
        "date_published": ""
      }
    },
    {
      "slug": "what-do-ir35-changes-mean-for-clients",
      "title": "What do IR35 changes mean for clients?",
      "content": "",
      "metadata": {
        "title": "What do IR35 changes mean for clients?",
        "subtitle": "",
        "content": "<p data-selectable-paragraph=\"\" id=\"98a8\">If you&rsquo;ve read over the weekend that <a href=\"https://www.freelanceinformer.com/news/the-moment-of-truth-has-arrived-ir35-repealed/\" rel=\"noopener ugc nofollow\" target=\"_blank\">IR35 has been repealed</a> &mdash; you might be forgiven for thinking that as a client, you no longer have any obligations to worry about whether working with freelancers is within or outside IR35.</p><p data-selectable-paragraph=\"\" id=\"3aa7\">For the avoidance of doubt IR35 still exists! But it&rsquo;s rather who has responsibility for determining whether a contract is inside or outside of IR35 has shifted back from payer to supplier.</p><p data-selectable-paragraph=\"\" id=\"08f5\">Companies who work with freelancers in recent years have had to go through the painful process of implementing new steps in hiring external and independent talent to collaborate with &mdash; namely validating whether a contract falls inside or outside of IR35. For many businesses, this was costly, has added additional burden to working with freelancers &mdash; in the most extreme cases, some put an outright halt on working with contractors, and for others, it has prevented companies truly engaging with their freelancers in a meaningful way, for fear of being &ldquo;at risk of IR35&rdquo;.</p><p data-selectable-paragraph=\"\" id=\"680e\">The September mini-budget has rolled back these changes &mdash; so that the &lsquo;determination&rsquo; once again falls back to the freelancer, or rather, it&rsquo;s the freelancers responsibility to ensure they&rsquo;re working in a way that doesn&rsquo;t fall within IR35, and the liability has shifted from the payer to the supplier.</p><p data-selectable-paragraph=\"\" id=\"6c3c\">Whilst that might sound like a huge positive for clients &mdash; it doesn&rsquo;t mean that throwing all of your process out of the window is the right move. Working with freelancers is a hugely beneficial partnership to your business, and having a good start to a project helps everyone to do their best work together.</p><p data-selectable-paragraph=\"\" id=\"a3ae\"><strong>1/ Keep your determination process in place&nbsp;</strong>&mdash; if you already have a process where you&rsquo;re looking at how you work with freelancers, and consistently you&rsquo;re seeing that your contract and ways of engaging with freelancers clearly would mean the project falls inside IR35 &mdash; let the freelancer know. Whilst you don&rsquo;t have the liability here &mdash; help them be aware of the implications. This might also mean changing some of the ways in which you work with freelancers &mdash; i.e. avoiding setting their working hours or demanding where they work from. IR35 hasn&rsquo;t gone away, and you can help your freelancers understand the implications of working with you. HMRC are likely to shift their focus on chasing suppliers now &mdash; and helping your most talented and trusted freelancers not get caught up into investigations by avoiding any behaviours which put them at risk, is still of benefit to you.</p><p data-selectable-paragraph=\"\" id=\"b225\"><strong>2/ Keep the early intervention in place&nbsp;</strong>&mdash; whilst additional administration burdens might have been painful, having a moment in the process where you clearly define the project goals and ways of working, a well defined and fair contract, a process to onboard the freelancer into your organisation, and a review process of who you are working with, are all positives for both sides of the relationship. The time you might save on reviewing IR35 status of contracts can be re-invested into better onboarding and engagement with your freelancers &mdash; or look at where you can improve working with freelancers at others stages in the project plan, such as dealing more effectively with invoices.</p><p data-selectable-paragraph=\"\" id=\"2c05\"><strong>3/ Keep the responsibility in place</strong> &mdash; one of the few positives that came from the changes to IR35 meant that internal accountability for relationships with freelancers became clearer. Someone had to take responsibility for putting IR35 changes in place. Make sure that internal accountability is maintained, and give that individual a role which now looks at building closer relationships with freelancers, rather than aiming to keep them at arms length to reduce risk. Look at ways you can develop a &ldquo;Chief Freelance Officer&rdquo; type role who goes beyond just contract review, but creates the best possible relationships with your extended workforce.</p><p data-selectable-paragraph=\"\" id=\"97f3\"><strong>4/ Consider how it unlocks your ability to engage with your freelancers&nbsp;</strong>&mdash; many organisations used IR35 as a reason why they could not offer their freelancers a better experience. Avoiding doing anything which looked like they were supporting independent partners in case it seemed like disguised employment &mdash; or simple confusion over what was and wasn&rsquo;t allowed &mdash; with the most common risk-averse strategy being: do nothing. With the liability falling back to freelancers &mdash; you&rsquo;re freer to offer support and access to things like resources and community, and the individual is able to decide whether or not to engage. It&rsquo;s also worth remembering that IR35 applies to contracts, not people &mdash; so engaging with individuals when they&rsquo;re not working with you is not a crime!</p><p data-selectable-paragraph=\"\" id=\"66da\"><strong>5/ Take this as an opportunity to review how you work with freelancers</strong> &mdash; it&rsquo;s not often that we are encouraged to review our policies and ways of working with external talent. It&rsquo;s often forced, but this change removes some of the obligations from clients, and creates space for you to reconsider how you work with freelancers &mdash; how can you build more effective networks of specialist that you can call upon, how can you augment your teams rather than just plugging gaps, how can you grow a community that extends your business proactively?</p><p data-selectable-paragraph=\"\" id=\"73e6\">As we continue with the backdrop of a hiring crisis and financial challenges for both businesses and individuals &mdash; finding ways to create a more flexible and fluid workforce which embraces working well with freelancers is a sensible strategy, and changes in legislation act as a great moment to consider what your future fluid workforce might look like.</p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/68e1b580-570c-11ed-8382-17e794f79682-pexels-karolina-grabowska-4386367.jpg",
          "imgix_url": "https://imgix.cosmicjs.com/68e1b580-570c-11ed-8382-17e794f79682-pexels-karolina-grabowska-4386367.jpg"
        },
        "is_featured": false,
        "articletype": {
          "key": "blog",
          "value": "blog"
        },
        "templateoverride": "",
        "downloadbox": {
          "description": "",
          "downloadkey": ""
        },
        "show_contactwidget": false,
        "date_published": "2022-09-28"
      }
    },
    {
      "slug": "freelancing-isnt-always-by-choice",
      "title": "Freelancing isn't always by choice",
      "content": "",
      "metadata": {
        "title": "Freelancing isn't always by choice",
        "subtitle": "Why we need to support the entire workforce",
        "content": "<p>Asking someone &quot;why did you choose to become self-employed?&quot; presumes that it was a choice.<br><br><a href=\"https://leapers.co/research\">Our research</a> data shows a non-insignificant proportion of freelancers found that self-employment was their only option, perhaps not being able to find a job which works around other requirements, or simply the only way to generate income.<br><br>This was especially true during COVID, and <a href=\"https://www.bbc.com/worklife/article/20221024-the-women-forced-to-choose-self-employment\">this data from the US</a> reflects that as an increasing proportion of people, especially for parents, and mothers moreso. A lack of affordable childcare, a lack of flexibility, a lack of roles which appreciate the challenges of parenting.<br><br>It&#39;s not just parenting which is the driver here - those with access issues, mental health conditions, ongoing physical health issues, carers, individuals with low-income, the list of reasons why many cannot find work which works, and people find themselves in contingent or precarious employment.<br><br>Many flourish in this way of working, many discover the benefits of self-employment - but many struggle in a situation which was not of their choosing or design, which can be hugely isolating and challenging without good preparation and support.<br><br>That&#39;s why we need to be supportive of all people working in all ways, rather than &quot;but you&#39;re self-employed, you chose not to be in employment, so all accountability should fall to you&quot; attitudes.<br><br>Not everyone has the privilege of being able to determine how they work.</p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/a6edea20-570b-11ed-8382-17e794f79682-pexels-pixabay-235554.jpg",
          "imgix_url": "https://imgix.cosmicjs.com/a6edea20-570b-11ed-8382-17e794f79682-pexels-pixabay-235554.jpg"
        },
        "is_featured": false,
        "articletype": {
          "key": "blog",
          "value": "blog"
        },
        "templateoverride": "",
        "downloadbox": {
          "description": "",
          "downloadkey": ""
        },
        "show_contactwidget": true,
        "date_published": "2022-10-28"
      }
    },
    {
      "slug": "alumni",
      "title": "Alumni",
      "content": "",
      "metadata": {
        "title": "Alumni",
        "subtitle": "Building an active network starts with those you've already worked with",
        "content": "<p>Creating an alumni of the freelancers you&#39;ve already worked with is an essential part of building your own network of trusted talent. There&#39;s always going to be a need to hire new people, but making sure you&#39;ve got a good sense of who you&#39;ve already worked with, their skills and strengths, and keeping it up to date, so you know who you can reach out to for the next brief, is more important.</p><p><br></p><p>The cost of finding and hiring new freelancers can be up to 30% of the project cost, so building an active and up to date alumni helps reduce both the cost and time to hire, between identifying the need and someone starting on the work.</p><p>There are platforms which help manage your freelancer talent pool, but depending on the size and frequency of using freelancers, in the absence of any process, just getting started with simple tools like email lists or a basic database can help accelerate finding and connecting to your existing talent.</p><p>Making sure you&#39;ve got permission to recontact your freelancers is essential, and keeping your alumni up to date with both permission, capabilities and their work status helps keep your alumni clean.</p><p>Having an actively managed alumni allows you to identify gaps in your capability base too - do you only have senior people, are you reliant on a single person for a certain skillset, does someone you used to work with no longer freelance?&nbsp;</p><p>An alumni can also help you identify both the cost and value of your network - what pricing bands are your network, what ROI have you seen delivered by certain individuals, what people work better on certain types of projects, what chemistry worked well, what markets and languages exist in your alumni?</p><p>An alumni also forms the basis of your ability to communicate with your network too - whether it be new opportunities and briefs, or simply updates on things you&#39;ve done this year. Letting your network know how the work they helped you with has gone on to have impact, is an important part of creating engagement, and supports their wellbeing and motivation - in fact, it&#39;s one of the <a href=\"https://www.freelancefriendly.business/\">Freelance Friendly</a> principles.</p><p>Creating and managing alumni does take effort, but the reward outweighs the investment in actively managing your freelance talent networks.</p><p>Even businesses who don&#39;t work with freelancers on a regular basis, are building active alumni networks, in order to extend their capabilities, and be more responsive to requirements without adding overheads - <a href=\"http://cfro.localhost/articles/recession-drives-80-of-businesses-to-work-more-with-freelancers.html\">especially during times of economic uncertainty</a>.</p><p><br></p><p>The <a href=\"http://cfro.localhost/chief-freelance-officer-matthew-knight.html\"><strong>Chief Freelance Officer</strong></a> can help you and your team build, review and manage your alumni. Get in touch to understand how an alumni could help your business.</p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/bb2c8420-4df0-11ed-8d4e-6306f8bc4fd1-pexels-yulia-pribytkova-8600666.jpg",
          "imgix_url": "https://imgix.cosmicjs.com/bb2c8420-4df0-11ed-8d4e-6306f8bc4fd1-pexels-yulia-pribytkova-8600666.jpg"
        },
        "is_featured": false,
        "articletype": {
          "key": "guide",
          "value": "guide"
        },
        "templateoverride": "",
        "downloadbox": {
          "description": "",
          "downloadkey": ""
        },
        "show_contactwidget": true,
        "date_published": ""
      }
    },
    {
      "slug": "recession-drives-80-of-businesses-to-work-more-with-freelancers",
      "title": "Recession drives 80% of businesses to work more with freelancers",
      "content": "",
      "metadata": {
        "title": "Recession drives 80% of businesses to work more with freelancers",
        "subtitle": "But, you've got to make sure you're working effectively with them.",
        "content": "<p><strong>Data&nbsp;</strong><a href=\"https://investors.fiverr.com/press-releases/press-releases-details/2022/85-of-U.S.-Business-Owners-Plan-to-Implement-a-Hiring-Freeze-During-Economic-Downturn-According-to-New-Data-from-Fiverr-Business/default.aspx\"><strong>published by fiverr</strong></a><strong>&nbsp;earlier this year suggests that almost 80% of businesses are more likely to use freelancers during times of economic uncertainty.</strong></p><p>Why? At a time when many businesses are making layoffs, putting hiring freezes in place, or struggling to hire into roles - engaging with the independent workforce delivers a number of highly valuable benefits.</p><p><br></p><p><strong>1/ Short Term Investment</strong> - rather than committing to a long-term hire, organisations can look to bring in capabilities for the projects they know they have to deliver, rather than taking a bet on what work they might need to deliver in the future.</p><p><br></p><p><strong>2/ Senior Catalysts</strong>&nbsp; - working with freelancers enables you to access the most senior individuals on a sprint basis, injecting some strategic or experienced thinking into the business. Fractional board level roles, highly experienced strategists, deep sector specialists. You&#39;re able to access their insight for a period of time.</p><p><br></p><p><strong>3/ Zero Overheads</strong> - working with freelancers provides an extension of your team without worrying about additional costs, like healthcare, office space, or computer equipment.&nbsp;</p><p><br></p><p><strong>4/ Infinite Capabilities</strong> - you&#39;re not limited to the skillsets that your owned employees have, but rather you&#39;re able to access any skills required for the projects on hand, with the reassurance that the freelancer knows how best to help you apply them.</p><p><br></p><p>Organisations who are engaging with freelancers are increasingly seeing &nbsp;freelancers as an extended part of their total workforce. Hybrid teams made up of both internal and external people are more and more being used to deliver brilliant work at pace.</p><p>However, without a considered process and policies in place for engaging freelancers - it can be inefficient and be more costly. If working with freelancers is a smart way of keeping staff costs manageable during economic downturns, make sure you&#39;re developing effective ways to work with freelancers.</p><p>There are five things we recommend any business does to make sure they&#39;re effectively engaging with freelancers, in order to reduce costs and improve effectiveness.</p><p><br></p><h3>AUDIT YOUR CURRENT PROCESSES</h3><p>Take a look at how you&#39;re currently working with freelancers, and identify any gaps and opportunities for improvements. think ahead to how things might change over the coming 12 months, especially with changes in law around IR35. Identify the most valuable areas for improvement to your effective ways of finding and working with freelancers.</p><p><br></p><h3>DEVELOP BETTER ONBOARDING</h3><p>Review and revise your onboarding materials and support content to ensure your freelancers have everything they need to do a good job, and hit the ground running. There&#39;s nothing worse than having someone sat around unable to do great work with you.</p><p><br></p><h3>BUILD A TRUSTED NETWORK AHEAD OF THE BRIEF</h3><p>Don&#39;t just post a brief when the project lands, start building a network of people before you need them, so they&#39;re ready to work with you. This means reviewing your alumni and attracting new talent over time. This saves time and recruiting costs.</p><p><br></p><h3>AUTOMATE WHERE POSSIBLE</h3><p>Remove any manual processes for things like payments, onboarding, contracts, etc, so there&#39;s no wasted time on things like chasing invoices, sorting out NDAs or contracts, sending onboarding packs. Identify talent and process platforms which reduce time and increase visibility of your talent pool. Saved time allows you to focus on the work.</p><p><br></p><h3>THINK STRATEGICALLY, NOT TACTICALLY</h3><p>Shift your mindset from gap filling to valuable project catalysts, who can you augment your project with to accelerate it, and get better value from bringing in specialists? Open up your freelance pool to the rest of your business, and make access to brilliant talent part of your way of working, rather than emergency overflow.</p><p><br></p><p>A strategic approach to building a network of trusted talent, onboarding, supporting and engaging with your extended workforce is essential to work with freelancers effectively.</p><p>If you&#39;re interested in exploring how your organisation can work better together with freelancers, invite us in for a conversation, or share how you&#39;re currently working with freelancers so we can help you spot gaps and opportunities to get more value from the independent workforce.</p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/4d296530-47b3-11ed-a3f1-f1a0ba7456eb-pexels-canva-studio-3194518.jpg",
          "imgix_url": "https://imgix.cosmicjs.com/4d296530-47b3-11ed-a3f1-f1a0ba7456eb-pexels-canva-studio-3194518.jpg"
        },
        "is_featured": false,
        "articletype": {
          "key": "blog",
          "value": "blog"
        },
        "templateoverride": "",
        "downloadbox": {
          "description": "",
          "downloadkey": ""
        },
        "show_contactwidget": true,
        "date_published": "2022-10-12"
      }
    },
    {
      "slug": "mental-health-awareness-day-2022",
      "title": "Mental Health Awareness Day 2022",
      "content": "",
      "metadata": {
        "title": "Five things you can do all year round to support mental health for freelancers",
        "subtitle": "",
        "content": "<p>If you didn&#39;t include your freelancers in your content and comms yesterday for Mental Health Awareness Day yesterday, here are five things you can do today, to continue helping them all year round:<br><br>1/ Signpost and support - 66% of freelancers don&#39;t know where to find mental health support that is relevant to their way of working. Signpost to Leapers or any of the great organisations in your sector. Leapers can help you create a signposting page for free.<br><br>2/ Reduce your payment terms - at the very least, pay on time. Too many invoices are still paid late, and with automation and platforms which make it effortless, there&#39;s really no excuse, especially during a mental health and financial crisis period.<br><br>3/ Follow up and feedback - let your freelancers know about the positive impact their work had. It&#39;s rare to hear about how our work went on to help people or results, so a quick email after a project to let them know of any campaign results or customer feedback is always valued.<br><br>4/ Check-in - drop an email to your freelancers, ask how they&#39;re doing, share some updates from your company, and find out what they&#39;re up to. It can help you keep your list up to date, especially if people have moved on from freelancing, but more importantly, helps to keep a connection.<br><br>5/ Listen - ask your freelancers what they need. you might not be in a position to solve all their challenges, but being aware of them helps you build stronger relationships. you might discover they&#39;re not interested in wellbeing events at all, but would love to share a desk space, for example.<br><br>My mission is to help businesses do their best work with freelancers, and I&#39;m keen to chat with any businesses who hire freelancers, to find the gaps and opportunities. Drop me a note.</p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/e0ce0190-4972-11ed-a3f1-f1a0ba7456eb-hannah-olinger-NXiIVnzBwZ8-unsplash.jpg",
          "imgix_url": "https://imgix.cosmicjs.com/e0ce0190-4972-11ed-a3f1-f1a0ba7456eb-hannah-olinger-NXiIVnzBwZ8-unsplash.jpg"
        },
        "is_featured": false,
        "articletype": {
          "key": "blog",
          "value": "blog"
        },
        "templateoverride": "",
        "downloadbox": {
          "description": "",
          "downloadkey": ""
        },
        "show_contactwidget": true,
        "date_published": "2022-10-10"
      }
    },
    {
      "slug": "getting-the-best-work-from-freelancers",
      "title": "Getting the best work from freelancers",
      "content": "",
      "metadata": {
        "title": "Getting the best work from freelancers.",
        "subtitle": "Find the ways to work better together with extended workforce",
        "content": "<p>Freelancers can often seem like they come at a price premium - but the value which working with freelancers brings can deliver higher ROI per project than a full time employee.&nbsp;</p><p>There&#39;s zero downtime, zero overheads, it&#39;s exactly the right person for the job, and independents are committed to doing work for you - if you create the right ways of working with your freelancers.&nbsp;</p><p>However, all too often, businesses neglect to put the correct structures in place, creating inefficiencies in finding, hiring, onboarding, briefing, collaborating, paying and maintaining relationships with trusted freelancers - making working with external independents more costly and less productive.&nbsp;</p><p>This inefficiency is often hidden - the best freelancers navigate the hurdles and gaps in order to deliver the best work they can, despite the cost and time savings more effective practices would deliver.&nbsp;</p><p>These gaps normally arise in organisations where there is little or no defined process for engaging freelancers - perhaps working with freelancers happens too infrequently to make it seem necessary; often it comes from rushing - and having little time to adequately support the external contractors; it can come from an incorrect understanding of how IR35 works or simply - no-one internally having time or knowing what might be useful.&nbsp;</p><p><br></p><p>As freelancers become more central and integrated to how businesses deliver work - not having policies and processes in place can lead to higher costs, longer timelines, lower quality work, or even an inability to hire freelancers again - 96% of freelancers would actively avoid working for clients who didn&#39;t support them to do their best work.</p><p>But where to start? What does it take to get the best from your freelancers, or build a network of trusted collaborators you can call upon?</p><p><br></p><p>The first step is an audit - to take stock of where you are today, what gaps and inefficiencies exist, and set a clear ambition for what your freelancer network could do for you.&nbsp;</p><p>From there, laser focus on removing hurdles and filling the strategic capability gaps makes your network robust and ready to activate.&nbsp;</p><p>Finally, a nurture and activation programme to grow your network and bring it closer to the heart of your business.&nbsp;</p><p><br></p><p>It won&#39;t be an overnight change - but investing in working better together with your extended network of talent delivers benefits beyond just cost.</p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/4d296530-47b3-11ed-a3f1-f1a0ba7456eb-pexels-canva-studio-3194518.jpg",
          "imgix_url": "https://imgix.cosmicjs.com/4d296530-47b3-11ed-a3f1-f1a0ba7456eb-pexels-canva-studio-3194518.jpg"
        },
        "is_featured": false,
        "articletype": {
          "key": "why",
          "value": "why"
        },
        "templateoverride": "",
        "downloadbox": {
          "description": "",
          "downloadkey": ""
        },
        "show_contactwidget": true
      }
    },
    {
      "slug": "the-unbundling-of-work",
      "title": "The unbundling of work.",
      "content": "",
      "metadata": {
        "title": "The unbundling of work",
        "subtitle": "From centralised nodes to networked relationships.",
        "content": "<p>Are we seeing the final unbundling of work?</p><p>Whilst the long tail of interconnected businesses who work together to bring us goods and services is not a new concept - each link in that chain, each supplier or provider, was in most ways encapsulated - the farmer owns the land and cattle, the mill owned the equipment and employees, the agency buys the laptops and hires the staff. Each unit would be a self-contained creator of something.</p><p>But we&#39;re increasingly seeing a shift further away from centralised ownership to decentralised coordination, reflected more and more in not just the progressive businesses, but also in the mainstream.</p><p><br></p><p>Employees are no longer tethered to a physical workplace.</p><p>People are no longer exclusive to a single employer.</p><p>Working hours are no longer fixed to the 9-5/M-F.</p><p>Employers are no longer restricted by a finite talent pool or obligation to provide work.</p><p>Workspaces no longer have a single occupant.</p><p>Teams no longer need to have a consistent shape over time.</p><p>Clients no longer need to be tied in to exclusive partners, or a single relationship to source their specialists.</p><p><br></p><p>The bundle of employer, employees, space, capabilities and relationships have shattered apart - and a new range of operating models, systems, platforms, opportunities and challenges have rushed in to fill the gaps.</p><p>And we&#39;re all feeling the growing pains - or at the very least, questioning how to adjust and redesign for what unbundled work looks like.</p><p><br></p><p>For freelancers, it feels like a huge new opportunity - a new openness to discovering and working with people who aren&#39;t already part of the team, means more businesses are investing in finding ways to build new extended workforces.</p><p>For businesses, it feels like a huge challenge, and without an active design process to pause and ask: &quot;What does the new shape of our workforce look like, and how do we work best with them?&quot;, the old models will be applied to the new models, and most likely fail - or at best, be harder work for poorer outcomes.</p><p>The unbundling of work means that where the cohesion and strength sits moves away from the elements in the supply chain, the entities, the organisations, the agencies, the employers - towards the connections, the networks. We need thicker, smarter, stronger well designed relationships, not just strong nodes.</p><p>We&#39;ll increasingly see services which offer these connections between nodes in the network - coworking spaces are places to assemble, talent platforms are ways to grow networks, communities are ways to strengthen those networks, and the emerging roles of people who help develop a strategy for designing and leveraging these networks - the space which I&#39;m inhabiting.</p><p>These networks take time to build, grow, develop and activate. You can&#39;t turn it on overnight. It requires proactive investment and nurturing. The businesses who saw this happening three years ago, are having successes now.&nbsp;</p><p>The unbundling is happening, whether you&#39;re engaged with it or not - and the organisations who don&#39;t take stock of what it means for their ways of working and total workforce, will find themselves even less able function in the next three years.</p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/bfe18bb0-4624-11ed-962b-4d4cf7599074-alina-grubnyak-ZiQkhI7417A-unsplash.jpg",
          "imgix_url": "https://imgix.cosmicjs.com/bfe18bb0-4624-11ed-962b-4d4cf7599074-alina-grubnyak-ZiQkhI7417A-unsplash.jpg"
        },
        "is_featured": false,
        "articletype": {
          "key": "why",
          "value": "why"
        },
        "templateoverride": ""
      }
    },
    {
      "slug": "why-organisations-need-new-internal-roles-to-support-freelancers",
      "title": "Why organisations need new internal roles to support freelancers",
      "content": "",
      "metadata": {
        "title": "Why organisations need new internal roles to support freelancers",
        "subtitle": "And it's not just a job for HR",
        "content": "<p>Back in 2019, when I first wrote about the concept of the <a href=\"https://www.linkedin.com/m/pulse/meet-chief-freelance-officer-matthew-knight/\" rel=\"noopener noreferrer\" target=\"_blank\">Chief Freelance Officer</a> - a new role within organisations, a few of the comments suggested that this role simply falls under HR/Talent/People functions.</p><p>I&rsquo;d argue it doesn&rsquo;t, it shouldn&rsquo;t, and it can&rsquo;t.</p><p><strong>The role of a Chief Freelance Officer is to ensure external talent is effectively nurtured, found, on-boarded, integrated, managed and supported, invested in wisely, used effectively, and shift mindsets about dynamic and temporary teams.</strong></p><p>This is <strong>not only</strong> a people function.</p><h3>One: It&rsquo;s a finance function.</h3><p>How much money are you spending on your partners, and is that money being turned back into positive ROI for the business? What is the impact of tax legislation around IR35? How can we make sure we&rsquo;re paying on-time? These require specialist financial consideration.</p><h3>Two: It&rsquo;s a project management function.</h3><p>The freelancer needs to be briefed on the details of the job, shown how to communicate and capture their time, navigate the complexity of interdependencies; and be supported to deliver work on time.</p><h3>Three: It&rsquo;s a team leader function.</h3><p>Understanding how good teams function, how to lead and support, how to create relationships between people, how to listen and be present, how to get the best out of your people, these are the hallmarks of a good leader.</p><h3>Four: It&rsquo;s an L&amp;D function.</h3><p>Ensuring that the talent you have access to is able to stay ahead of the capabilities you require, ensuring that they&rsquo;re able to deliver new skills, that they&rsquo;re aware of the new tools and approaches, that they can deliver to the quality you expect falls under a different discipline again.</p><h3>Five: It&rsquo;s a legal function.</h3><p>There&rsquo;s a different set of contracts, legislation, rules and compliance that needs to be upheld when working with external talent, even the simple invitation for someone to come and work on site with you needs consideration and legal diligence.</p><h3>Six: It&rsquo;s an technology function.</h3><p>Connecting up the ability for internal, external, on-site, remote and ad-hoc members of your team to collaborate with security and ease requires different thinking, and rapid responses to changing needs.</p><h3>Seven: It&rsquo;s a marketing function.</h3><p>Attracting temporary talent takes brand building, awareness in the marketplace, management of your reputation and reviews, and getting people excited about the projects you&rsquo;re working on, and getting the briefs out there for people to apply.</p><h3>Eight: It&rsquo;s an organisational design function.</h3><p>Spinning up teams which combine internal and external people, often at pace, requires a different approach to internal communications, on-boarding, performance review, feedback - team design and operations.</p><h3>Nine: it&#39;s a quality of work function.&nbsp;</h3><p>Responsibility for work done, and the quality to which it is done - especially done by those who are not inside your direct control, and, many times are an unknown quotient.&nbsp;</p><h3>Ten: it&#39;s a strategy function.</h3><p>Shifting towards new models of work requires thinking strategically about where and how different approaches to work can and should be applied, about how it affects you relationships with your staff and your customers, and needs careful consideration surrounding sustainability of your business&#39;s outputs, when you don&#39;t directly manage its inputs.&nbsp;</p><h3>Eleven: It&#39;s an innovation function.</h3><p>There are few established models for rapidly setting up new teams of diverse individuals, and running them effectively. This is new territory for many, so hoping that old models will be effective, or worse simply ignoring the challenge - will not lead to positive outcomes. Trying new approaches, new tools and techniques, being open to testing and innovating in how your teams work together is essential.</p><h3>Twelve: it&#39;s a pastoral function.&nbsp;</h3><p>Ultimately, someone has to care about this - and feel it&#39;s an important thing to do, not only commercially, creatively, qualitatively, effectively but from a human perspective. Care about the experience of everyone you work with, regardless of contract.&nbsp;</p><p><strong>...</strong></p><p><strong>In reality it&#39;s a horizontal role</strong> which touches upon many disciplines - and requires engagement from many different departments and specialisms. Modern roles are increasingly horizontal - spanning different types of conversations, requiring skills to engage with a variety of challenges.</p><p><strong>Yes, it takes a village - but it also takes an individual to stand up and say &quot;we need to do something here to bring the village together, to welcome and work with our visitors&quot;.&nbsp;</strong></p><p>I&#39;m not suggesting this doesn&#39;t have it&#39;s feet firmly in people and talent functions, I absolutely believe that the best talent teams have their peoples&#39; best at heart - what I am saying is, regardless of who and where the individual sits, someone needs to coordinate the efforts to get the most from and give the best to the people you work with and rely upon; and regardless of what level, what function, what team, what job title, whether it&rsquo;s a full-time role or part of someone&rsquo;s broader role - <strong>it is a missing part of many modern businesses.</strong></p><p>I believe companies have a commercial, legal, qualitative and ethical imperative to actively design how they engage with their entire workforce, not just those who are under a traditional contract, and we will all benefit from working better together with others.</p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/a54f7eb0-447b-11ed-8a6e-0bfcf4e18462-priscilla-du-preez-tKUKEIWFMsc-unsplash.jpg",
          "imgix_url": "https://imgix.cosmicjs.com/a54f7eb0-447b-11ed-8a6e-0bfcf4e18462-priscilla-du-preez-tKUKEIWFMsc-unsplash.jpg"
        },
        "is_featured": false,
        "articletype": {
          "key": "why",
          "value": "why"
        },
        "templateoverride": ""
      }
    },
    {
      "slug": "work-with-us",
      "title": "Work with us",
      "content": "",
      "metadata": {
        "title": "Work with us",
        "subtitle": "Ways you can work with The Chief Freelance Officer",
        "content": "<p>We work with organisations who want to work better together with their freelancers.&nbsp;</p><p>Every organisation has different requirements, so we take a consultative approach to conversations - listening to your needs, challenges and helping you identify gaps and opportunities.</p><p>We offer discounts for micro-businesses, non-profits, or organisations who use a minimal number of freelancers a year.</p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/755e1bf0-43ca-11ed-9e32-b5466b0215d5-copernico-yfmU1uLmp8-unsplash.jpg",
          "imgix_url": "https://imgix.cosmicjs.com/755e1bf0-43ca-11ed-9e32-b5466b0215d5-copernico-yfmU1uLmp8-unsplash.jpg"
        },
        "is_featured": true,
        "articletype": {
          "key": "about",
          "value": "about"
        },
        "offers": [
          {
            "title": "AUDITING",
            "body": "We always recommend starting with a short audit - a rapid review of how you're currently working with freelancers designed to identify gaps and opportunities. You'll receive a report on our observations and recommendations.",
            "price": "from 750 + VAT"
          },
          {
            "title": "ALUMNI",
            "body": "We'll help you curate your alumni to understand it's current make-up, capability gaps and strengths, and simplify communication and engagement with your extended workforce. you'll receive a database with opted-in members, and capability mapping. This is often the first step towards building your own talent network or community.",
            "price": "From 1500 + VAT (based upon community size)"
          },
          {
            "title": "ONBOARDING",
            "body": "We'll help you create an effective onboarding programme to streamline working with your freelancers, identifying the best platforms and technology to help you onboard and support your people.",
            "price": "From 2000 + VAT (based on process complexity)"
          },
          {
            "title": "COMMUNITY",
            "body": "We'll help you develop a robust network talent platform or community engagement programme for the independents and freelancers you work with. We can manage this for you, or work with your internal teams to deliver on your strategic goals.",
            "price": "P.O.A."
          },
          {
            "title": "CONSULTING",
            "body": "We'll collaborate with your organisation to craft a bespoke project tailored to your specific requirements and goals - from process design, talent attraction and engagement, onboarding and briefing, talent sourcing and community activation. ",
            "price": "P.O.A."
          },
          {
            "title": "SUPPORT SIGNPOSTING",
            "body": "Working with the Leapers community - we'll create you a bespoke support and signposting page, pointing your freelancers to useful resources and content for wellbeing.",
            "price": "FREE"
          }
        ],
        "templateoverride": "workwithus.twig.html",
        "downloadbox": {
          "description": "",
          "downloadkey": ""
        },
        "show_contactwidget": true
      }
    },
    {
      "slug": "why-working-better-together-with-freelancers-matters",
      "title": "Why working better together with freelancers matters",
      "content": "",
      "metadata": {
        "title": "Why working better together matters",
        "subtitle": "Key reasons and steps to invest in working better with freelancers",
        "content": "<p><strong>With January being the month</strong> where employees are most likely to think about leaving their job, 2020 set to be another year with huge growth in the number of people turning to self-employment and freelancing as their primary source of income, and according to research: <strong>64% of firms rely upon freelancers as part of their workforce</strong> - there&rsquo;s no better time for businesses to start thinking seriously about how they better engage with, and work effectively with their freelance workforce.</p><p>___</p><p><strong>If it had escaped your attention</strong>, freelancers are not your employees - so have not been given the induction to why your business exists, have not had the time to understand the internal culture and ways of working you have, don&rsquo;t have the luxury of months to build trust and relationships with the team. They&rsquo;re often in your business for a short period of time, with a focused task at hand - and this requires a different approach to working.&nbsp;</p><p>Unfortunately - many businesses are not actively considering how to work with freelancers in the most effective and supportive way, with freelancers often being &lsquo;bolted on&rsquo; to teams and expected to get hit the ground running. Why does this matter? There are three main reasons you might want to think about this.</p><blockquote>&quot;Working with freelancers effectively requires a different approach to working together well&quot;</blockquote><p><strong>Financial</strong> - if you&rsquo;re not effectively engaging with your suppliers and workforce, you&rsquo;re losing money. Stories of freelancers waiting around in reception to be collected, not being able to connect to the internal systems, not being briefed adequately, time spent on setting up contracts and payments, anything which gets in the way of being productive leads to you losing money. Designing better ways to engage with an ad-hoc workforce will not only save you money, but create better profitability, unlocking access more diverse and more experienced talent for your growth.</p><p><strong>Quality</strong> - if you&rsquo;re not designing your workforce to work together well, if you&rsquo;re not creating high performing teams, if you&rsquo;re not considering how relationships are created over time and giving your people the best chance of creating the best work, the quality of your work suffers. Most people just want to do their best work, but we hold them back by not designing work better.</p><p><strong>People</strong> - the 5m+ people who are self-employed have little or no workplace support when it comes to mental health. You&rsquo;ve invested in the wellbeing of your employees, because you understand the human cost and business cost, but if you&rsquo;re ignoring a sizeable proportion of your workforce - you&rsquo;ll not be able to access that talent in the future. If you believe the future of work is more flexible and agile, and you want to continue to be able to use a diverse workforce on demand, you need to invest in its wellbeing.</p><p>___</p><p><strong>Based upon the work we&rsquo;ve done with freelancers and businesses who hire freelancers</strong>, there are 8 essential things to consider to design a more effective experience for both your business and the individual:</p><h2>1. Create Accountability</h2><p>There generally isn&rsquo;t any single individual who takes responsibility for understanding the freelance experience, so things fall between the gaps. Give someone responsibility for asking questions, checking for issues, and addressing the problems. You&rsquo;ll save money, time and headaches by understanding where you&rsquo;re ineffective.</p><h2>2. Trusted Networks</h2><p>Shift the mindset from &lsquo;on-demand resource&rsquo; to building &rsquo;trusted networks of talent&rsquo;, which you can augment your workforce with, not just based upon capabilities, but how they work with you. Trusted talent networks reduce time to hire, cost to hire, risk and improve quality and profitability.</p><h2>3. Onboarding</h2><p>Look at how you&rsquo;re welcoming external talent to your business, to ensure they&rsquo;re off to a good start, and you&rsquo;re not neglecting any emotional, legal, health and safety duties when you&rsquo;re working with others. It&rsquo;s easy, can often be automated, and helps you create your alumni.</p><h2>4. Team Building</h2><p>Rethink how you design teams based upon integrating internal and external talent, or how you cast a team based upon differing work styles, mindsets, capabilities and experience - not just job titles. Your team doesn&rsquo;t have three months to &lsquo;bed in&rsquo;.&nbsp;</p><h2>5. In-Project Effectiveness</h2><p>Look at what the structures you need in place to ensure everyone is being supported, your project is running effectively, and how you resolve issues. Understand how you are defining and measuring performance, and start to reflect the value of external talent in your business metrics, rather than seeing it only as a &lsquo;cost&rsquo;.</p><h2>6. Process and Payments</h2><p>Fix the basics, get people paid on time and quickly, create contracts better suited to freelance engagement, understand and consider IR35 with nuance rather than making blanket decisions, and get people paid on time and quickly. Pay people on time, and pay people on time. You&rsquo;ll be saving on late payment fees, reducing impact on your accounts team, and you&rsquo;ll not get blacklisted by your talent.</p><h2>7. Post Project Feedback</h2><p>Create feedback loops to better understand your process, but also provide feedback to those you&rsquo;ve worked with. It&rsquo;s an essential part of being motivated about the work you&rsquo;re doing, but also creates a way of building positive relationships with your talent.</p><h2>8. Investment in Alumni</h2><p>Looping back to your trusted networks, create an alumni who you can call upon, invest in their training, development and support whilst you&rsquo;re not working with them, and make sure you&rsquo;re creating a workforce you can continue to call upon.</p><p><strong>Don&rsquo;t try and do all this at once</strong>, but if there&rsquo;s one thing you can do, <strong>start with accountability</strong>, and make sure someone is asking how effectively are you engaging with your growing external workforce.&nbsp;</p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/371cc300-43ca-11ed-9e32-b5466b0215d5-shridhar-gupta-dZxQn4VEv2M-unsplash.jpg",
          "imgix_url": "https://imgix.cosmicjs.com/371cc300-43ca-11ed-9e32-b5466b0215d5-shridhar-gupta-dZxQn4VEv2M-unsplash.jpg"
        },
        "is_featured": true,
        "articletype": {
          "key": "why",
          "value": "why"
        }
      }
    },
    {
      "slug": "onboarding",
      "title": "Onboarding",
      "content": "",
      "metadata": {
        "title": "Onboarding",
        "subtitle": "starting off strong",
        "content": "<p><strong>Helping your freelancers get started on the best possible way helps you make best use of their time, helps them understand your business and ways of working, and helps everyone get stuck in to the work.</strong></p><p>Freelancers are often brilliant at figuring things out for themselves. They need to be, as often they have to navigate a new client organisation at the start of every project, and often they don&#39;t get any useful onboarding. Just imagine how much wasted time spent on figuring things out, rather than having a useful guide to help them.</p><p>Onboarding might seem like something you only do for your employees, but sharing some critical information about your company, your values, the work you do, how you work, who you work with, and the super important &nbsp;things that you freelancers really need to know like points of contact, useful resources, frequently asked questions, and even things like where the best lunch places are locally, all really help. Not just to work more effectively, but also to create a better relationship with your freelancers - and we know that freelancers who feel better supported are more likely to be open to working with you again.</p><p>You don&#39;t need to host an on-boarding session - you can automate the process to share information, you can provide it as a standard pack for every freelancer, and just make sure it&#39;s up to date every few months. And I&#39;ve created a template to help you get started, which lists the key sections we recommend to include, based upon insights from our community of thousands of freelancers.</p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/4bf0d500-435c-11ed-8c64-7d07ad237bd8-jukan-tateisi-bJhT8nbUA0-unsplash.jpg",
          "imgix_url": "https://imgix.cosmicjs.com/4bf0d500-435c-11ed-8c64-7d07ad237bd8-jukan-tateisi-bJhT8nbUA0-unsplash.jpg"
        },
        "is_featured": false,
        "articletype": {
          "key": "guide",
          "value": "guide"
        },
        "templateoverride": "",
        "downloadbox": {
          "description": "<p>We&#39;ve created an onboarding boilerplate to help any business get started with the basics.</p><p>A handy template to help you cover the key elements we recommend to include, and provides the absolute basics you should be sharing.</p>",
          "downloadkey": "onboarding"
        },
        "show_contactwidget": false
      }
    },
    {
      "slug": "chief-freelance-officer-matthew-knight",
      "title": "Who is the Chief Freelance Officer?",
      "content": "",
      "metadata": {
        "title": "Who is the Chief Freelance Officer?",
        "subtitle": "Matthew Knight supports your organisation to work better together with freelancers",
        "content": "<p>With over 25 years working in self-employment, leading agencies, working inside client businesses, building teams combining freelancers and employees, and founding the award winning freelancer community Leapers - Matthew Knight is the Chief Freelance Officer.</p><p>Matthew works with organisations who recognise that the future of their workforce combines freelancers, consultants, independent workers, external suppliers and their own employees - and want to work in the best possible way across each of these types of people.</p><p>Contact <a href=\"mailto:mk@the.independency.co\">mk@the.independency.co</a>&nbsp;<a href=\"mailto:matthew@chieffreelanceofficer.co.uk\"></a>to explore how he can help you work better together with independents.</p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/974f6080-435b-11ed-8c64-7d07ad237bd8-matthew-knight.webp",
          "imgix_url": "https://imgix.cosmicjs.com/974f6080-435b-11ed-8c64-7d07ad237bd8-matthew-knight.webp"
        },
        "is_featured": true,
        "articletype": {
          "key": "about",
          "value": "about"
        },
        "templateoverride": "whois.twig.html",
        "downloadbox": {
          "description": "",
          "downloadkey": ""
        },
        "show_contactwidget": false
      }
    },
    {
      "slug": "signposting-to-mental-health-support",
      "title": "Signposting to mental health support",
      "content": "",
      "metadata": {
        "title": "Signposting to mental health support",
        "subtitle": "Essential support for wellbeing",
        "content": "<p data-selectable-paragraph=\"\" id=\"5dfd\"><strong>Mental Health at work has never been more on the agenda of employers (and employees).&nbsp;</strong>After two years of disruption in the way we work, and an ongoing background of stress caused by economic, ecological and geopolitical turmoil, it&rsquo;s not surprising that the very best business leaders are looking at what more they can do to take care of their people.</p><p data-selectable-paragraph=\"\" id=\"cf43\">However, that rightful care for people also needs extends to the &lsquo;<a href=\"https://www.hrotoday.com/news/sourcing/multi-process-hr/new-total-workforce/\" rel=\"noopener ugc nofollow\" target=\"_blank\">total workforce</a>&rsquo;, not just those who are on payroll, but also those you work with under contract, such as freelancers.</p><p data-selectable-paragraph=\"\" id=\"7d48\">Whilst there can be challenges in directly supporting freelancers, whether it be <a href=\"https://www.contractorweekly.com/general-news/freelancers-mental-health/\" rel=\"noopener ugc nofollow\" target=\"_blank\">IR35</a> getting in the way, time, budget or even just not knowing where to start or who has internal responsibility, often it can be the simplest things which are most effective &mdash; good communication, fair payment terms, feedback during and after the project.</p><p data-selectable-paragraph=\"\" id=\"baf5\">Every year, <a href=\"https://www.leapers.co/research\" rel=\"noopener ugc nofollow\" target=\"_blank\">our research shows</a>, however, that freelancers rarely know where to turn for support for their own mental health at work. It&rsquo;s a big reason why we exist as a project, to be one of the sources of support, as well as signpost to other valid and good quality support mechanisms, but we can only be effective in doing that if people know about us.</p><p data-selectable-paragraph=\"\" id=\"c9f0\">That&rsquo;s why <strong>signposting</strong> for employers is so critical and important as the first step in supporting your total workforce.</p><p data-selectable-paragraph=\"\" id=\"2008\">S<strong>ignposting</strong> is the simple act of helping people be more aware of where they can find support.</p><p data-selectable-paragraph=\"\" id=\"4fae\">It&rsquo;s a step before providing that support yourself, and often is adopted more readily than your own support &mdash; as you&rsquo;re letting people know a range of places where they can seek impartial and independent help.</p><p data-selectable-paragraph=\"\" id=\"53bc\">This is <em>especially important for the self-employed</em> as they may not want to let their client know they&rsquo;re struggling emotionally, as often the freelancer might feel it could create concern the project will not be completed, only adding to further stress (even if their client might be wonderfully supportive, the anxiety of sharing can be worse than reality), and a majority of freelancers say they would not share with their client if they were feeling stressed or suffering with poor mental health.</p><h3 data-selectable-paragraph=\"\" id=\"d00b\">How does signposting work?</h3><p data-selectable-paragraph=\"\" id=\"7534\">At its simplest, it&rsquo;s about providing a list of useful and authoritative sources for support &mdash; places your people can turn to, in order to find out more, to connect with someone, to reach out and get what they need.</p><p data-selectable-paragraph=\"\" id=\"c903\">Those sources and materials need to be of <em>good quality, rooted in evidence, from authoritative and respected providers</em>, and be written in a understanding and supportive way &mdash; that&rsquo;s not &ldquo;You won&rsquo;t believe these ten ways to improve your mental health&rdquo; listicles, but content that can be trusted.</p><p data-selectable-paragraph=\"\" id=\"a735\">Secondly, those resources <em>need to be relevant to the self-employed experience&nbsp;</em>&mdash; content which suggests &ldquo;make sure you use your paid sick leave to rest&rdquo; isn&rsquo;t going to help a freelancer, nor is &ldquo;speak to your line manager or HR team&rdquo;. Whilst 80% of mental health resources are relevant to 80% of people, helping them find content which tackles the unique issues they might be facing is essential.</p><p data-selectable-paragraph=\"\" id=\"b507\">Thirdly, it&rsquo;s not just about content, but also community and support services which they can turn to in times of need. That could be counselling or therapy services, it could be local healthcare services, it could be peer-support and community networks. It&rsquo;s not enough to just offer reading material, but aim for offering genuine connection.</p><p data-selectable-paragraph=\"\" id=\"18bb\">Signposting will often simply be a list, helping the individual to navigate the links and resources which could help &mdash; that list could be a downloadble PDF, it might be a page on your intranet, it could be a poster in the breakout room, some employers offer phone numbers or support email addresses to ask questions, or even chatbots to intelligently automate the process.</p><p data-selectable-paragraph=\"\" id=\"d55e\">But critically &mdash; it must be <em>visible and easily accessible</em> to the individual.</p><p data-selectable-paragraph=\"\" id=\"239d\">This means you need to both create the signposting resources and ensure it&rsquo;s communicated to everyone you work with. <a href=\"https://www.shrm.org/hr-today/news/hr-magazine/winter2019/pages/companies-seek-to-boost-low-usage-of-employee-assistance-programs.aspx\" rel=\"noopener ugc nofollow\" target=\"_blank\">Recent research shows</a> that whilst over 97% of large companies offer support platforms like an EAP, only 6% of people are using them, and over 50% of employees don&rsquo;t know they exist or think there isn&rsquo;t one &mdash; pointing to the importance of communications in any sort of signposting and support.</p><p data-selectable-paragraph=\"\" id=\"4014\">For the self-employed, t<em>his communication is even harder</em>: there is rarely a formal onboarding process or documentation the individual receives at the start of a project and more often than not, they&rsquo;re not part of an EAP; and more important: as they don&rsquo;t have the time or space to find it themselves.</p><p data-selectable-paragraph=\"\" id=\"d361\">I&rsquo;ve worked with businesses who offered their freelancers access to amazing levels of support, but none of their freelancers (or people who were bringing those freelancers in) knew it was available, making the investment and effort a waste of time.</p><h3 data-selectable-paragraph=\"\" id=\"a050\">So what to do?</h3><p data-selectable-paragraph=\"\" id=\"45f6\"><a href=\"https://leapers.co/\" rel=\"noopener ugc nofollow\" target=\"_blank\"><strong>Leapers</strong></a> is committed to tackling this issue by offering a free signposting service for any organisation who hires freelancers. We&rsquo;re doing this because we don&rsquo;t believe there should be no excuses in not signposting, but also recognise the time and effort it takes to create these resources can fall beyond priorities and responsibilities. So we&rsquo;ll do the hard work!</p><p data-selectable-paragraph=\"\" id=\"bc27\"><strong>STEP 1 &mdash; SIGNPOSTING</strong><br>We&rsquo;ve built a customisable landing page, which you can send your freelancers to when they arrive in your business, and we take care of making sure the links, resources and content are up to date and relevant for your people. It&rsquo;s entirely free to use, <a href=\"https://www.leapers.co/freelance-friendly/home#signpost\" rel=\"noopener ugc nofollow\" target=\"_blank\">just let us know</a> and we&rsquo;ll create your own page which you can send to your freelancers.</p><p data-selectable-paragraph=\"\" id=\"cbab\"><strong>STEP 2 &mdash; COMMUNICATING</strong><br>We&rsquo;re building a tool to help with the communication challenge too, it&rsquo;s as simple as inviting your freelancer (just their email address and bing, you&rsquo;re done!), and we&rsquo;ll handle the rest. They&rsquo;ll get signposted to support, invited to a peer-community, and join your freelance alumni &mdash; all in a single go. We&rsquo;re inviting organisations who are interested in trying this out to <a href=\"https://airtable.com/shrxp3E4cLY175ecd\" rel=\"noopener ugc nofollow\" target=\"_blank\">drop us a note</a>, and we&rsquo;ll get you involved in the beta tests.</p><p data-selectable-paragraph=\"\" id=\"2287\">There are plenty more things which you can do, of course, to support your freelancers&rsquo; mental health, all of which not only support the individual, but also lead to more motivated, more engaged, more creative and and better quality work from your freelancers &mdash; it even leads to freelancers prioritising those clients who support them over those who don&rsquo;t &mdash; but to start with, if you&rsquo;re not already signposting,<em>&nbsp;it&rsquo;s the least you can do.</em></p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/6d5c3000-4356-11ed-8c64-7d07ad237bd8-dan-meyers-hluOJZjLVXc-unsplash.jpg",
          "imgix_url": "https://imgix.cosmicjs.com/6d5c3000-4356-11ed-8c64-7d07ad237bd8-dan-meyers-hluOJZjLVXc-unsplash.jpg"
        },
        "is_featured": false,
        "articletype": {
          "key": "guide",
          "value": "guide"
        }
      }
    },
    {
      "slug": "supporting-freelancers-feeling-isolated",
      "title": "Tackling Isolation",
      "content": "",
      "metadata": {
        "title": "Isolation and Freelancers",
        "subtitle": "The role we can play in tackling loneliness and why it creates better work.",
        "content": "<p>Loneliness is <a href=\"https://www.campaigntoendloneliness.org/the-facts-on-loneliness/\">an epidemic in the UK</a> - and effects 25 million people across our country. It not only shortens life-spans but also reduces productivity, creativity and motivation. The shift in recent years to remote working and the effects of COVID have had a dramatic knock on effect to people feeling isolated - and a group of people that isolation can affect dramatically is the self-employed.</p><p>Indeed, it&#39;s a common assumption that freelancers will struggle with feelings of loneliness and isolation. Our <a href=\"https://www.leapers.co/resources/guide-to/dealing-with-loneliness-when-freelancing\">research shows that</a> over 70% have felt affected by isolation and loneliness when self-employed.</p><p>Often for those new to freelancing, the sudden shift to having a team around them, to shouldering the responsibility for everything - doing the work, accounting, new biz, marketing, admin, development, legals - can be a shock to the system.&nbsp;</p><p>Even established freelancers can feel disconnected and very much on their own - and the move to more organisations means often freelancers are not spending time in their clients offices as much.</p><p>The answer for those individuals is to build support networks - taking the time to join communities, create connections, and building their own team. Projects like <a href=\"https://leapers.co\">Leapers</a> exist to support freelancers creating support networks - and there are many communities who offer connection and support for independent workers across different sectors and categories.</p><p>As a client, you&#39;re also part of this team, and can also play a valuable role in supporting the freelancer in tackling isolation.</p><p>Clients can open their doors to their workspaces (I&#39;ve had a number of clients recently welcome me into their space - even though we&#39;re not working together currently).&nbsp;</p><p>Clients can create horizontal connections between their freelancers.&nbsp;</p><p>Clients can check-in and catch-up with their freelance alumni to see how things are going, or share updates on what impact a project they worked on together had.</p><p>Playing a support role provides multiple benefits for you as a client.&nbsp;</p><p>Firstly, the positive mental health of your independents directly relates to their productivity, quality of work, and ability to work.</p><p>Secondly, it creates a positive relationship between you and your extended workforce - freelancers are more likely to work again with clients who have supported them, and when building a network of trusted collaborators who you can work with again and again, this is essential.</p><p>Finally - it builds your reputation as a Freelance Friendly organisation, furthering your ability to attract and work with new independents who build your capabilities over time.</p><p>As a client - you play an important part in the support system of your freelancers, and working together effectively is an important part of your talent strategy as an organisation.</p>",
        "image": {
          "url": "https://cdn.cosmicjs.com/310bac90-4340-11ed-8c64-7d07ad237bd8-sasha-freemind-Pv5WeEyxMWU-unsplash.jpg",
          "imgix_url": "https://imgix.cosmicjs.com/310bac90-4340-11ed-8c64-7d07ad237bd8-sasha-freemind-Pv5WeEyxMWU-unsplash.jpg"
        },
        "is_featured": false,
        "articletype": {
          "key": "blog",
          "value": "blog"
        },
        "templateoverride": "",
        "downloadbox": {
          "description": "",
          "downloadkey": ""
        },
        "show_contactwidget": true,
        "date_published": "2022-10-04"
      }
    }
  ],
  "total": 18
}